Revit 2022 API
Autodesk.Revit.DB.Electrical Namespace
Classes
Class | Description
CableTray
 This class represents a cable tray in Autodesk Revit.
CableTrayConduitBase
 The CableTrayConduitBase class is implemented as the base class for cable tray or conduit
CableTrayConduitRunBase
 The base class for a cable tray or conduit run in Autodesk Revit.
CableTrayRun
 This class represents a cable tray run in Autodesk Revit.
CableTraySettings
 The cable tray settings.
CableTraySizeIterator
 An iterator to a set of MEP cable tray sizes from CableTraySizes.
CableTraySizes
 Cable tray sizes.
CableTrayType
 This class represents a cable tray type in Autodesk Revit.
CircuitNamingScheme
 This class represents a circuit naming scheme in Autodesk Revit.
CircuitNamingSchemeSettings
 This class represents a circuit naming scheme settings in Autodesk Revit.
Conduit
 This class represents a conduit in Autodesk Revit.
ConduitRun
 This class represents a conduit run in Autodesk Revit.
ConduitSettings
 The conduit settings.
ConduitSize
 Stores the basic size information for a conduit.
ConduitSizeIterator
 An iterator to a set of conduit sizes from ConduitSizes.
ConduitSizes
 Class ConduitSizeSet being used to store the conduit sizes.
ConduitSizeSettingIterator
 An iterator to a set of items from ConduitSizeSettings. Each item is a KeyValuePair(System::String^, ConduitSizes). ElementId is the id of the conduit standard type.
ConduitSizeSettings
 Conduit sizes settings
ConduitType
 This class represents a conduit type in Autodesk Revit.
CorrectionFactor
 Represents electrical correction factor information.
CorrectionFactorSet
A set that contains correction factors.
CorrectionFactorSetIterator
An iterator to a correction factor set.
DistributionSysType
Represents a specific type of distribution system.
DistributionSysTypeSet
A set that contains DistributionSys types.
DistributionSysTypeSetIterator
An iterator to a DistributionSys type set.
ElectricalDemandFactorDefinition
 The ElectricalDemandFactorDef class represents a serialized version of an instance of demand factor definition. It has a name, rule type, and values for the rules that are serialized.
ElectricalDemandFactorValue
 This class represents values used by a particular demand factor definition. Each instance corresponds to a row in a table of values. These values are part of the ElectricalDemandFactorDefinition class.
ElectricalEquipment
 Provides access to the Electrical Equipment in Autodesk Revit.
ElectricalLoadClassification
 The ElectricalLoadClassification class represents a serialized version of an instance of load classification.
ElectricalSetting
 The ElectricalSetting class represents an instance of element of electrical settings.
ElectricalSystem
 Provides access to the Electrical System in Autodesk Revit MEP.
ElectricalSystemSet |  Obsolete.
A set that can contain any type of object.
ElectricalSystemSetIterator |  Obsolete.
An iterator to a set.
GroundConductorSize
 Represents electrical ground conductor size definition information.
GroundConductorSizeSet
A set that contains GroundConductorSizes.
GroundConductorSizeSetIterator
An iterator to a GroundConductorSize set.
InsulationType
 Represents electrical insulation type definition information.
InsulationTypeSet
A set that contains insulation types.
InsulationTypeSetIterator
An iterator to a insulation type set.
LightingDevice
Provides access to the Lighting Device in Autodesk Revit MEP.
LightingFixture
Provides access to the Lighting Fixture in Autodesk Revit MEP.
PanelScheduleData
 The PanelScheduleData class holds most of the data that describe the layout, appearance, and style of the rows, columns, and cells of a panel schedule
PanelScheduleSheetInstance
 The class represents an instance of a panel schedule placed on sheet.
PanelScheduleTemplate
 The PanelScheduleTemplate class represents an instance of panel schedule template element. An instance object could be a branch panel, a switchboard or a data panel template.
PanelScheduleView
 An instance of a panel schedule view.
TemperatureRatingType
 Represents temperature rating type definition information.
TemperatureRatingTypeSet
A set that contains TemperatureRating types.
TemperatureRatingTypeSetIterator
An iterator to a TemperatureRating type set.
VoltageType
Represents electrical voltage type. An electrical voltage type define a range of voltages, and circuits can be created between components with rated voltages that do not precisely match the voltage definition value.
VoltageTypeSet
A set that contains voltage types.
VoltageTypeSetIterator
An iterator to a voltage type set.
Wire
 Electrical wire element.
WireConduitType
 Represents a specific conduit type of wire type.
WireConduitTypeSet
A set that contains conduit types.
WireConduitTypeSetIterator
An iterator to a conduit type set.
WireMaterialType
 Represents electrical wire material type definition information of wire type.
WireMaterialTypeSet
A set that contains wire material types.
WireMaterialTypeSetIterator
An iterator to a wire material type set.
WireSet
A set that can contain any type of object.
WireSetIterator
An iterator to a set.
WireSize
 Represents specific electrical wire size information.
WireSizeSet
A set that contains wire sizes.
WireSizeSetIterator
An iterator to a wire size set.
WireType
 Represents a specific wire type.
WireTypeSet
A set that contains wire types.
WireTypeSetIterator
An iterator to a wire type set.
Enumerations
Enumeration | Description
CableTrayShape
 Shape types enum of cable tray
CapitalizationForLoadNames
 Enumerated type listing the options for how electrical load names should be capitalized.
CircuitConnectionType
 An enumerated type indicates the panel to panel connection type
CircuitLoadCalculationMethod
 Methods to calculate circuit loads
CircuitNaming
 An enumerated type listing all the circuit naming options.
CircuitNumberingOption
 An enumerated type listing all the circuit numbering options.
CircuitSequence
 Options of circuit sequence for assigning circuit to circuits across panel.
CircuitType
 An enumerated type listing all the possible circuit types.
ElectricalCircuitPathMode
 An enumerated type indicates the circuit path mode
ElectricalDemandFactorRule
 This enum describes the different demand factor rule types available to the application. Within a demand factor a rule will be referenced and the user will have to enter values corresponding to that rule.
ElectricalLoadClassificationData
 This enum is used by the ElectricalLoadClassification class as additional data whenever data members changed. It is used as the additional data when the atom corresponding to each data member is touched.
ElectricalLoadClassificationSpace
 This enum is used by the ElectricalLoadClassification to specify the load class for use with spaces.
ElectricalPhase
An enumerated type to specify whether the electrical system is single phase or three phase.
ElectricalPhaseConfiguration
An enumerated type to specify the electrical phase configuration.
ElectricalSystemType
 An enumerated type listing all the possible electrical system types for a connector object.
LoadClassification
 An enumerated type to list all demand factor classifications.
LoadClassificationType
An enumerated type listing all the possible load classification types for a connector object.
NeutralMode
An enumerated type to list the neutral mode for wire type.
PanelConfiguration
 This enum declares the configuration for given panel schedule type.
PanelSchedulePhaseLoadType
 Declares the panel schedule type. The comments for each enum type show a simple example of how the layout would look when applied to a panel schedule
PanelScheduleType
 This enum declares the panel schedule type.
PowerFactorStateType
 An enumerated type listing all the possible power factor state types for a connector object.
WiringType
 An enumerated type to list all wiring types.